tutorials/testcases/wakeVortices/Allrun
#!/bin/bash

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions


runApplication blockMesh
runApplication simpleFoam

#runApplication decomposePar
#runParallel simpleFoam 4

