tutorials/testcases/wakeVortices/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    velocities
    {
        type            wakeVelocity;
        functionObjectLibs ( "libBellerophon.so" );
        outputControl   timeStep;
        outputInterval  1;

        min             (4 0.01 0.5);
        max             (4 0.99 0.5);
        nPoints         3;
        amplitude       (0 0 0.4);
        period          20;
        phaseLag        0;
        Uname           U;

    }
}
libs ("libBellerophon.so");

// ************************************************************************* //
